% Факты с одним аргументом
% Факты принадлежности к мужскому полу
man("Мальцев Владимир Борисович").
man("Силинцев Владимир Алексеевич").
man("Устюгов Егор Матвеевич").
man("Зачиняев Василий Кузьмич").
man("Мальцев Анатолий Владимирович").
man("Силинцев Андрей Владимирович").
man("Силинцев Сергей Владимирович").
man("Зачиняев Геннадий Васильевич").
man("Зачиняев Юрий Васильевич").
man("Силинцев Алексей Сергеевич").
man("Силинцев Виталий Сергеевич").
man("Силинцев Сергей Витальевич").
man("Силинцев Владислав Витальевич").
man("Силинцев Данил Витальевич").

% Факты принадлежности к женскому полу
woman("Мальцева Зоя Васильевна").
woman("Силинцева Анастасия Ивановна").
woman("Устюгова Зоя Акимовна").
woman("Зачиняева Татьяна Кузьмовна").
woman("Огошкова Галина Владимировна").
woman("Силинцева Нина Владимировна").
woman("Горских Людмила Егоровна").
woman("Кораблева Валентина Егоровна").
woman("Зачиняева Татьяна Егоровна").
woman("Деева Раиса Васильевна").
woman("Тамендарова Елена Васильевна").
woman("Иванова Людмила Васильевна").
woman("Щетинина Светлана Васильевна").
woman("Силинцева Алёна Олеговна").
woman("Силинцева Анастасия Петровна").
woman("Силинцева Мария Юрьевна").
woman("Зачиняева Наталья Юрьевна").
woman("Силинцева Софья Алексеевна").

% Факты с двумя аргументами
% Факты для отношений родитель - ребенок
parent("Мальцева Зоя Васильевна", "Мальцев Анатолий Владимирович").
parent("Мальцев Владимир Борисович", "Мальцев Анатолий Владимирович").
parent("Мальцева Зоя Васильевна", "Огошкова Галина Владимировна").
parent("Мальцев Владимир Борисович", "Огошкова Галина Владимировна").
parent("Мальцева Зоя Васильевна", "Силинцева Нина Владимировна").
parent("Мальцев Владимир Борисович", "Силинцева Нина Владимировна").
parent("Силинцев Владимир Алексеевич", "Силинцев Андрей Владимирович").
parent("Силинцева Анастасия Ивановна", "Силинцев Андрей Владимирович").
parent("Силинцев Владимир Алексеевич", "Силинцев Сергей Владимирович").
parent("Силинцева Анастасия Ивановна", "Силинцев Сергей Владимирович").
parent("Устюгов Егор Матвеевич", "Горских Людмила Егоровна").
parent("Устюгова Зоя Акимовна", "Горских Людмила Егоровна").
parent("Устюгов Егор Матвеевич", "Кораблева Валентина Егоровна").
parent("Устюгова Зоя Акимовна", "Кораблева Валентина Егоровна").
parent("Устюгов Егор Матвеевич", "Зачиняева Татьяна Егоровна").
parent("Устюгова Зоя Акимовна", "Зачиняева Татьяна Егоровна").
parent("Зачиняев Василий Кузьмич", "Зачиняев Геннадий Васильевич").
parent("Зачиняева Татьяна Кузьмовна", "Зачиняев Геннадий Васильевич").
parent("Зачиняев Василий Кузьмич", "Деева Раиса Васильевна").
parent("Зачиняева Татьяна Кузьмовна", "Деева Раиса Васильевна").
parent("Зачиняев Василий Кузьмич", "Тамендарова Елена Васильевна").
parent("Зачиняева Татьяна Кузьмовна", "Тамендарова Елена Васильевна").
parent("Зачиняев Василий Кузьмич", "Иванова Людмила Васильевна").
parent("Зачиняева Татьяна Кузьмовна", "Иванова Людмила Васильевна").
parent("Зачиняев Василий Кузьмич", "Щетинина Светлана Васильевна").
parent("Зачиняева Татьяна Кузьмовна", "Щетинина Светлана Васильевна").
parent("Зачиняев Василий Кузьмич", "Зачиняев Юрий Васильевич").
parent("Зачиняева Татьяна Кузьмовна", "Зачиняев Юрий Васильевич").
parent("Силинцева Нина Владимировна", "Силинцев Алексей Сергеевич").
parent("Силинцев Сергей Владимирович", "Силинцев Алексей Сергеевич").
parent("Силинцева Нина Владимировна", "Силинцев Виталий Сергеевич").
parent("Силинцев Сергей Владимирович", "Силинцев Виталий Сергеевич").
parent("Зачиняева Татьяна Егоровна", "Зачиняева Наталья Юрьевна").
parent("Зачиняев Юрий Васильевич", "Зачиняева Наталья Юрьевна").
parent("Зачиняева Татьяна Егоровна", "Силинцева Мария Юрьевна").
parent("Зачиняев Юрий Васильевич", "Силинцева Мария Юрьевна").
parent("Силинцев Алексей Сергеевич", "Силинцева Софья Алексеевна").
parent("Силинцева Анастасия Петровна", "Силинцева Софья Алексеевна").
parent("Силинцев Виталий Сергеевич", "Силинцев Владислав Витальевич").
parent("Силинцева Мария Юрьевна", "Силинцев Владислав Витальевич").
parent("Силинцев Виталий Сергеевич", "Силинцев Данил Витальевич").
parent("Силинцева Мария Юрьевна", "Силинцев Данил Витальевич").
parent("Силинцев Виталий Сергеевич", "Силинцев Сергей Витальевич").
parent("Силинцева Мария Юрьевна", "Силинцев Сергей Витальевич").

% Факты рождения
birth("Мальцев Владимир Борисович", 1926).
birth("Мальцева Зоя Васильевна", 1931).
birth("Силинцев Владимир Алексеевич", 1932).
birth("Силинцева Анастасия Ивановна", 1937).
birth("Устюгов Егор Матвеевич", 1928).
birth("Устюгова Зоя Акимовна", 1933).
birth("Зачиняев Василий Кузьмич", 1910).
birth("Зачиняева Татьяна Кузьмовна", 1915).
birth("Мальцев Анатолий Владимирович", 1951).
birth("Огошкова Галина Владимировна", 1952).
birth("Силинцева Нина Владимировна", 1957).
birth("Силинцев Андрей Владимирович", 1961).
birth("Силинцев Сергей Владимирович", 1958).
birth("Горских Людмила Егоровна", 1955).
birth("Кораблева Валентина Егоровна", 1963).
birth("Зачиняева Татьяна Егоровна", 1958).
birth("Зачиняев Геннадий Васильевич", 1935).
birth("Деева Раиса Васильевна", 1940).
birth("Тамендарова Елена Васильевна", 1945).
birth("Иванова Людмила Васильевна", 1947).
birth("Щетинина Светлана Васильевна", 1950).
birth("Зачиняев Юрий Васильевич", 1953).
birth("Силинцева Алёна Олеговна", 1988).
birth("Силинцев Алексей Сергеевич", 1984).
birth("Силинцева Анастасия Петровна", 1983).
birth("Силинцев Виталий Сергеевич", 1980).
birth("Силинцева Мария Юрьевна", 1979).
birth("Зачиняева Наталья Юрьевна", 1984).
birth("Силинцева Софья Алексеевна", 2010).
birth("Силинцев Сергей Витальевич", 2011).
birth("Силинцев Владислав Витальевич", 2005).
birth("Силинцев Данил Витальевич", 2021).

% Факты смерти
death("Мальцев Владимир Борисович", 1997).
death("Мальцева Зоя Васильевна", 2022).
death("Силинцев Владимир Алексеевич", 2008).
death("Устюгов Егор Матвеевич", 1986).
death("Устюгова Зоя Акимовна", 1979).
death("Зачиняев Василий Кузьмич", 1978).
death("Зачиняева Татьяна Кузьмовна", 1984).
death("Силинцев Андрей Владимирович", 2012).
death("Силинцев Сергей Владимирович", 2014).
death("Зачиняев Геннадий Васильевич", 2023).
death("Деева Раиса Васильевна", 2018).

% Факты с тремя аргументами
% Факты заключения брака
marry("Мальцев Владимир Борисович", "Мальцева Зоя Васильевна", 1951).
marry("Силинцев Владимир Алексеевич", "Силинцева Анастасия Ивановна", 1958).
marry("Устюгов Егор Матвеевич", "Устюгова Зоя Акимовна", 1954).
marry("Зачиняев Василий Кузьмич", "Зачиняева Татьяна Кузьмовна", 1933).
marry("Силинцев Нина Владимировна", "Силинцев Сергей Владимирович", 1979).
marry("Зачиняева Татьяна Егоровна", "Зачиняев Юрий Васильевич", 1978).
marry("Силинцева Алёна Олеговна", "Силинцев Алексей Сергеевич", 2022).
marry("Силинцев Алексей Сергеевич", "Силинцева Анастасия Петровна", 2007).
marry("Силинцев Виталий Сергеевич", "Силинцева Мария Юрьевна", 2001).

% Правило: заключение брака не зависит от порядка
marry(X, Y, Z):- marry(Y, X, Z), !.

% Факты расторжения брака
divorce("Силинцев Алексей Сергеевич", "Силинцева Анастасия Петровна", 2020).
divorce("Силинцева Анастасия Петровна", "Силинцев Алексей Сергеевич", 2020).

% Определить возраст человека в выбранный год (Year)
how_old(Name, Year, Age) :-
    birth(Name, BirthYear),
    BirthYear =< Year,
    (
    	(death(Name, DeathYear), Year =< DeathYear, Age is Year - BirthYear);   
        (\+ death(Name, _), Age is Year - BirthYear)
    ).

% Считается ли человек мертвым в выбранный год (Year)
is_dead(X, Year):- 
	death(X, DeathYear),
	Year >= DeathYear.

% Считаются ли люди в разводе в выбранный год (Year)
were_divorced(X, Y, Year):-
	divorce(X, Y, DivorceYear),
	Year >= DivorceYear.

% Считаются ли люди в браке в выбранный год (Year)
were_married(X, Y, Year):- 
	marry(X, Y, WeddingYear),
	WeddingYear =< Year,
	Year =< 2025,
	\+is_dead(X, Year),
	\+is_dead(Y, Year),
	\+were_divorced(X, Y, Year).

% Мужчины и женщины являются людьми
person(X):- man(X); woman(X).

% Является ли человек X прадедушкой или прабабушкой для человека Y
grandparent(X, Y):- parent(X, Z), parent(Z, Y).

% Является ли человек X прабабушкой для человека Y
grandmother(X, Y):-
	grandparent(X, Y),
	woman(X).

% Является ли человек X прадедушкой для человека Y
grandfather(X, Y):-
	grandparent(X, Y),
	man(X).

% Является ли человек X предком для человека Y
ancestor(X, Y):- parent(X,Y).
ancestor(X, Y):- parent(X, Z), ancestor(Z, Y).
